<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Operations-to-Handle-Missing-Data-in-Pandas-Data-Structures:" data-toc-modified-id="Operations-to-Handle-Missing-Data-in-Pandas-Data-Structures:-1">Operations to Handle Missing Data in Pandas Data Structures:</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Finding-Missing-Data):" data-toc-modified-id="Part-1-(Finding-Missing-Data):-1.1">Part 1 (Finding Missing Data):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Finding-Missing-Data---Method-1):" data-toc-modified-id="Example-1.1-(Finding-Missing-Data---Method-1):-1.1.1">Example 1.1 (Finding Missing Data - Method 1):</a></span></li><li><span><a href="#Example-1.2-(Finding-Missing-Data---Method-2):" data-toc-modified-id="Example-1.2-(Finding-Missing-Data---Method-2):-1.1.2">Example 1.2 (Finding Missing Data - Method 2):</a></span></li><li><span><a href="#Example-1.3-(Finding-Missing-Data---Method-3):" data-toc-modified-id="Example-1.3-(Finding-Missing-Data---Method-3):-1.1.3">Example 1.3 (Finding Missing Data - Method 3):</a></span></li></ul></li><li><span><a href="#Part-2-(Inserting-Missing-Data):" data-toc-modified-id="Part-2-(Inserting-Missing-Data):-1.2">Part 2 (Inserting Missing Data):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Inserting-Missing-Data-into-Int):" data-toc-modified-id="Example-2.1-(Inserting-Missing-Data-into-Int):-1.2.1">Example 2.1 (Inserting Missing Data into Int):</a></span></li><li><span><a href="#Example-2.2-(Inserting-Missing-Data-into-Int):" data-toc-modified-id="Example-2.2-(Inserting-Missing-Data-into-Int):-1.2.2">Example 2.2 (Inserting Missing Data into Int):</a></span></li></ul></li><li><span><a href="#Part-3-(Cleaning/Filling-Missing-Data):" data-toc-modified-id="Part-3-(Cleaning/Filling-Missing-Data):-1.3">Part 3 (Cleaning/Filling Missing Data):</a></span><ul class="toc-item"><li><span><a href="#Example-3.1-(Filling-NA-with-Value):" data-toc-modified-id="Example-3.1-(Filling-NA-with-Value):-1.3.1">Example 3.1 (Filling NA with Value):</a></span></li><li><span><a href="#Example-3.2-(Dropping-Axis-Labels-with-Missing-Values):" data-toc-modified-id="Example-3.2-(Dropping-Axis-Labels-with-Missing-Values):-1.3.2">Example 3.2 (Dropping Axis Labels with Missing Values):</a></span></li></ul></li></ul></li><li><span><a href="#5.1.5.3-Operations-to-Handle-Time-Series-Data-in-Pandas-Data-Structures:" data-toc-modified-id="5.1.5.3-Operations-to-Handle-Time-Series-Data-in-Pandas-Data-Structures:-2">5.1.5.3 Operations to Handle Time Series Data in Pandas Data Structures:</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Initiating-Objects):" data-toc-modified-id="Part-1-(Initiating-Objects):-2.1">Part 1 (Initiating Objects):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Initiating-Timestamp):" data-toc-modified-id="Example-1.1-(Initiating-Timestamp):-2.1.1">Example 1.1 (Initiating Timestamp):</a></span></li><li><span><a href="#Example-1.1.1-(Using-pd.Timestamp()):" data-toc-modified-id="Example-1.1.1-(Using-pd.Timestamp()):-2.1.2">Example 1.1.1 (Using <code>pd.Timestamp()</code>):</a></span></li><li><span><a href="#Example-1.1.2-(Using-pd.to_datetime()):" data-toc-modified-id="Example-1.1.2-(Using-pd.to_datetime()):-2.1.3">Example 1.1.2 (Using <code>pd.to_datetime()</code>):</a></span></li><li><span><a href="#Example-1.2-(Initiating-DatetimeIndex):" data-toc-modified-id="Example-1.2-(Initiating-DatetimeIndex):-2.1.4">Example 1.2 (Initiating DatetimeIndex):</a></span></li><li><span><a href="#Example-1.2.1-(Using-pd.date_range()):" data-toc-modified-id="Example-1.2.1-(Using-pd.date_range()):-2.1.5">Example 1.2.1 (Using <code>pd.date_range()</code>):</a></span></li><li><span><a href="#Example-1.3-(Initiating-Period):" data-toc-modified-id="Example-1.3-(Initiating-Period):-2.1.6">Example 1.3 (Initiating Period):</a></span></li><li><span><a href="#Example-1.3.1-(Using-pd.Period()):" data-toc-modified-id="Example-1.3.1-(Using-pd.Period()):-2.1.7">Example 1.3.1 (Using <code>pd.Period()</code>):</a></span></li><li><span><a href="#Example-1.4-(Initiating-PeriodIndex):" data-toc-modified-id="Example-1.4-(Initiating-PeriodIndex):-2.1.8">Example 1.4 (Initiating PeriodIndex):</a></span></li><li><span><a href="#Example-1.4.1-(Using-pd.period_range()):" data-toc-modified-id="Example-1.4.1-(Using-pd.period_range()):-2.1.9">Example 1.4.1 (Using <code>pd.period_range()</code>):</a></span></li></ul></li><li><span><a href="#Part-2-(Common-Operations):" data-toc-modified-id="Part-2-(Common-Operations):-2.2">Part 2 (Common Operations):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Using-Shift):" data-toc-modified-id="Example-2.1-(Using-Shift):-2.2.1">Example 2.1 (Using Shift):</a></span></li><li><span><a href="#Example-2.2-(Using-Resample):" data-toc-modified-id="Example-2.2-(Using-Resample):-2.2.2">Example 2.2 (Using Resample):</a></span></li><li><span><a href="#Example-2.3-(Using-Rolling):" data-toc-modified-id="Example-2.3-(Using-Rolling):-2.2.3">Example 2.3 (Using Rolling):</a></span></li></ul></li></ul></li></ul></div>

### Operations to Handle Missing Data in Pandas Data Structures:

 Note two `NaN` values do not compare equal (i.e. `np.nan == np.nan` is evaluated as `False`)

In [99]:
na_df = df = pd.DataFrame(np.arange(15).reshape(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                          columns=['one', 'two', 'three'])
na_df = na_df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
na_df

    one   two  three
a   0.0   1.0    2.0
b   NaN   NaN    NaN
c   3.0   4.0    5.0
d   NaN   NaN    NaN
e   6.0   7.0    8.0
f   9.0  10.0   11.0
g   NaN   NaN    NaN
h  12.0  13.0   14.0

#### Part 1 (Finding Missing Data):

##### Example 1.1 (Finding Missing Data - Method 1):

In [100]:
na_df.isna() # check elements that are missing

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [101]:
na_df.notna() # check elements that are not missing

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

##### Example 1.2 (Finding Missing Data - Method 2):

In [102]:
na_df.isnull() # check elements that are missing

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [103]:
na_df.notnull() # check elements that are not missing

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

##### Example 1.3 (Finding Missing Data - Method 3):

In [104]:
np.count_nonzero(na_df.isnull()) # total number of missing values

9

In [105]:
np.count_nonzero(np.any(na_df.isnull(), axis=0)) # total number of columns with missing values

3

In [106]:
np.count_nonzero(np.any(na_df.isnull(), axis=1)) # total number of rows with missing values

3

#### Part 2 (Inserting Missing Data):

In [107]:
na_df["four"] = "Allen"
na_df

    one   two  three   four
a   0.0   1.0    2.0  Allen
b   NaN   NaN    NaN  Allen
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

##### Example 2.1 (Inserting Missing Data into Int):

In [108]:
na_df.loc["a", "two"] = None # fills as NaN since replacing an int
na_df.loc["a", "three"] = np.nan # fills as NaN 
na_df

    one   two  three   four
a   0.0   NaN    NaN  Allen
b   NaN   NaN    NaN  Allen
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

##### Example 2.2 (Inserting Missing Data into Int):

In [109]:
na_df.loc["a", "four"] = np.nan # fills as None since replacing a str
na_df.loc["b", "four"] = None # fills as None
na_df

    one   two  three   four
a   0.0   NaN    NaN    NaN
b   NaN   NaN    NaN   None
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

#### Part 3 (Cleaning/Filling Missing Data):

##### Example 3.1 (Filling NA with Value):

In [110]:
na_df.fillna("NEW")

   one  two three   four
a    0  NEW   NEW    NEW
b  NEW  NEW   NEW    NEW
c    3    4     5  Allen
d  NEW  NEW   NEW  Allen
e    6    7     8  Allen
f    9   10    11  Allen
g  NEW  NEW   NEW  Allen
h   12   13    14  Allen

##### Example 3.2 (Dropping Axis Labels with Missing Values):

In [111]:
na_df

    one   two  three   four
a   0.0   NaN    NaN    NaN
b   NaN   NaN    NaN   None
c   3.0   4.0    5.0  Allen
d   NaN   NaN    NaN  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
g   NaN   NaN    NaN  Allen
h  12.0  13.0   14.0  Allen

In [112]:
na_df.dropna(axis=0) # remove rows that have NA values

    one   two  three   four
c   3.0   4.0    5.0  Allen
e   6.0   7.0    8.0  Allen
f   9.0  10.0   11.0  Allen
h  12.0  13.0   14.0  Allen

### 5.1.5.3 Operations to Handle Time Series Data in Pandas Data Structures:

Note: Pandas Time Series capabilities leverage the NumPy `datetime64` and `timedelta54` dtypes and you will find these as the type of the object after initializing a Timestamp, Period, etc.

#### Part 1 (Initiating Objects):

In [113]:
from datetime import datetime

##### Example 1.1 (Initiating Timestamp):

##### Example 1.1.1 (Using `pd.Timestamp()`):

In [114]:
pd.Timestamp("2018-04-23")

Timestamp('2018-04-23 00:00:00')

In [115]:
pd.Timestamp(2018, 4, 23)

Timestamp('2018-04-23 00:00:00')

##### Example 1.1.2 (Using `pd.to_datetime()`):

In [116]:
pd.to_datetime("2018/04/23")

Timestamp('2018-04-23 00:00:00')

##### Example 1.2 (Initiating DatetimeIndex):

##### Example 1.2.1 (Using `pd.date_range()`):

In [117]:
first_week = pd.date_range("2018/04/23", periods = 7, freq = "D") # first week of class 
first_week

DatetimeIndex(['2018-04-23', '2018-04-24', '2018-04-25', '2018-04-26',
               '2018-04-27', '2018-04-28', '2018-04-29'],
              dtype='datetime64[ns]', freq='D')

In [118]:
first_week_day_num = pd.Series(np.arange(1,8), index = first_week)
first_week_day_num

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
2018-04-28    6
2018-04-29    7
Freq: D, dtype: int64

In [119]:
converted_first_week = first_week_day_num.asfreq("B") # class only happens on business days 
converted_first_week

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
Freq: B, dtype: int64

See [here](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases) for the possible time series frequencies that can be used and their Pandas Aliases.

##### Example 1.3 (Initiating Period):

##### Example 1.3.1 (Using `pd.Period()`):

In [120]:
pd.Period("2018-04") # inferred as Month

Period('2018-04', 'M')

In [121]:
pd.Period("2018-04-23") # inferred as Day

Period('2018-04-23', 'D')

##### Example 1.4 (Initiating PeriodIndex):

##### Example 1.4.1 (Using `pd.period_range()`):

In [122]:
pd.period_range(start="2018-04-23", end = "May-31-2018", freq = "M")

PeriodIndex(['2018-04', '2018-05'], dtype='period[M]', freq='M')

#### Part 2 (Common Operations):

##### Example 2.1 (Using Shift):

In [123]:
converted_first_week

2018-04-23    1
2018-04-24    2
2018-04-25    3
2018-04-26    4
2018-04-27    5
Freq: B, dtype: int64

In [124]:
converted_first_week.shift(2) # shift values by 2 periods

2018-04-23    NaN
2018-04-24    NaN
2018-04-25    1.0
2018-04-26    2.0
2018-04-27    3.0
Freq: B, dtype: float64

##### Example 2.2 (Using Resample):

In [125]:
rng = pd.date_range('4/23/2018', periods=100, freq='S') # range of 100 seconds
ts = pd.Series(np.arange(len(rng)), index = rng) # fill in values of 0 - 100
ts.head()

2018-04-23 00:00:00    0
2018-04-23 00:00:01    1
2018-04-23 00:00:02    2
2018-04-23 00:00:03    3
2018-04-23 00:00:04    4
Freq: S, dtype: int64

In [126]:
ts.resample("Min").sum() # 1 minute totals

2018-04-23 00:00:00    1770
2018-04-23 00:01:00    3180
Freq: T, dtype: int64

##### Example 2.3 (Using Rolling):

In [127]:
df = pd.DataFrame({'Counts': [10, 31, 42, 5, 1, np.nan]})
df

   Counts
0    10.0
1    31.0
2    42.0
3     5.0
4     1.0
5     NaN

In [128]:
df.rolling(2).sum() # rolling sum with window length of 2 (sum of every 2 values) - ignored NaN

   Counts
0     NaN
1    41.0
2    73.0
3    47.0
4     6.0
5     NaN

In [129]:
df.rolling(window = 2, min_periods = 1).sum() # rolling sum with window length of 2 (sum of every 2 values) - adds if there is at least 1 value in the window

   Counts
0    10.0
1    41.0
2    73.0
3    47.0
4     6.0
5     1.0